# MissKeynoteParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeynoteFailures..::..MissKeynoteParameter Property
BuiltInFailures..::..KeynoteFailures Class See Also
---
No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MissKeynoteParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MissKeynoteParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MissKeynoteParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeynoteFailures Class
Autodesk.Revit.DB Namespace